app/controllers/api/v1/recipes_controller.rb

INSERT INTO "recipes" ("name", "description", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["name", "Cooking mandazi mix"], ["description", "Tamu tamu"], ["created_at", 2017-01-20 05:38:13 UTC], ["updated_at", 2017-01-20 05:38:13 UTC], ["user_id", 2]]
---
def create
  @recipe = Recipe.new(recipe_params)
  if @recipe.save

DELETE FROM "recipes" WHERE "recipes"."id" = ?  [["id", 1]]
---
def destroy
  if @recipe.destroy