app/controllers/friendships_controller.rb

	def destroy
		@friendship = Friendship.where( user_id: current_user, friend_id: params[:friend_id])

		    if  @friendship.destroy(@friendship)
---
SELECT  "friendships".* FROM "friendships" WHERE "friendships"."user_id" = 1 AND "friendships"."friend_id" = ? AND "friendships"."id" = ? LIMIT ?  [["friend_id", 1], ["id", 6], ["LIMIT", 1]]
DELETE FROM "friendships" WHERE "friendships"."id" = ?  [["id", 6]]