app/controllers/recipes_controller.rb

SELECT "recipes".* FROM "recipes"
SELECT COUNT(*) FROM "recipes"
---
  def index
    @recipes = Recipe.paginate(page: params[:page], per_page: 6)

INSERT INTO "recipes" ("name", "description", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["name", "Oaky"], ["description", "Crisps and Matoke"], ["created_at", 2017-01-14 16:29:18 UTC], ["updated_at", 2017-01-14 16:29:18 UTC], ["user_id", 1]]
---
  def create
    @recipe = Recipe.new(recipe_params.merge(user_id: current_user.id))
    # @recipe.user = current_user

    respond_to do |format|
      if @recipe.save

UPDATE "recipes" SET "description" = ?, "updated_at" = ? WHERE "recipes"."id" = ?  [["description", "How to cook niceUgali, lol"], ["updated_at", 2017-01-14 15:33:27 UTC], ["id", 2]]
---
  def update
    respond_to do |format|
      if @recipe.update(recipe_params)