app/controllers/user_recipes_controller.rb

  def index
    @user_recipes = UserRecipe.all
---
SELECT "user_recipes".* FROM "user_recipes"

  def create

    @user_recipe = UserRecipe.new( recipe_id: params[:recipe_id], user_id: current_user.id)

    respond_to do |format|
      if @user_recipe.save
---
INSERT INTO "user_recipes" ("user_id", "recipe_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["recipe_id", 1], ["created_at", 2017-01-14 08:50:57 UTC], ["updated_at", 2017-01-14 08:50:57 UTC]]

  def destroy
    @user_recipe = UserRecipe.where(user_id: current_user, recipe_id: params[:recipe_id])

    if  @user_recipe.destroy(@user_recipe)
---
SELECT  "user_recipes".* FROM "user_recipes" WHERE "user_recipes"."user_id" = 1 AND "user_recipes"."recipe_id" = ? AND "user_recipes"."id" = ? LIMIT ?  [["recipe_id", 2], ["id", 2], ["LIMIT", 1]]
DELETE FROM "user_recipes" WHERE "user_recipes"."id" = ?  [["id", 2]]

    def set_user_recipe
      @user_recipe = UserRecipe.find(params[:id])
---
SELECT  "user_recipes".* FROM "user_recipes" WHERE "user_recipes"."recipe_id" = ? AND "user_recipes"."id" = ? LIMIT ?  [["recipe_id", 2], ["id", 2], ["LIMIT", 1]]