app/controllers/users_controller.rb

SELECT "recipes".* FROM "recipes" WHERE "recipes"."user_id" = ?  [["user_id", 2]]
SELECT COUNT(*) FROM "recipes" WHERE "recipes"."user_id" = ?  [["user_id", 2]]
---
def my_recipes
	@user = current_user
	@user_recipes = Recipe.where(user_id: current_user.id).paginate(page: params[:page], per_page: 9)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
	def show
	@friend = User.find(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 2], ["LIMIT", 1]]
INSERT INTO "friendships" ("user_id", "friend_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 2], ["friend_id", 1], ["created_at", 2017-01-14 17:58:33 UTC], ["updated_at", 2017-01-14 17:58:33 UTC]]
---
	def add_friend
		@friend = User.find(params[:friend])
		current_user.friendships.build(friend_id: @friend.id)
		if current_user.save